LavalNozzle/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          300;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
inlet
    {
        type            totalTemperature;
        T0              $internalField;
        gamma           1.4;
        value           $internalField;
    }

    downstreamOutlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    farfield
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    nozzle
    {
        type            zeroGradient;
    }

    middle
    {
        type            symmetryPlane;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
