LavalNozzle/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

// TODO: parametrize
lNozzle 10;
xmax    500;
ymax    50;

vertices
(
    // nozzle back
    (0 0 0)        // 0
    ($lNozzle 0 0)       // 1
    ($lNozzle 0.85 0)     // 2
    (0 0.85 0)        // 3
    (0 0 0.1)         // 4
    ($lNozzle 0 0.1)          // 5
    ($lNozzle 0.85 0.1)          // 6
    (0 0.85 0.1)          // 7

    // outlet downstream of the nozzle
    ($xmax 0 0)       // 8
    ($xmax 0.8 0)     // 9
    ($xmax 0 0.1)          // 10
    ($xmax 0.8 0.1)          // 11

    // downstream of the nozzle wall
    ($lNozzle 0.9 0)          // 12
    ($xmax 0.9 0)          // 13
    ($lNozzle 0.9 0.1)          // 14
    ($xmax 0.9 0.1)          // 15

    // outlet in the top right corner
    ($lNozzle $ymax 0)          // 16
    ($xmax $ymax 0)          // 17
    ($lNozzle $ymax 0.1)          // 18
    ($xmax $ymax 0.1)          // 19
    

    // outlet / nozzle wall at top left
    (0 0.9 0)          // 20
    (0 $ymax 0)          // 21
    (0 $ymax 0.1)          // 22
    (0 0.9 0.1)          // 23
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (400 50 1) simpleGrading (0.25 0.4 1)      // block 0
    hex (1 8 9 2 5 10 11 6) (1000 50 1) simpleGrading (200 0.4 1)      // block 1
    hex (2 9 13 12 6 11 15 14) (1000 4 1) simpleGrading (200 1 1)      // block 2
    hex (12 13 17 16 14 15 19 18) (1000 50 1) simpleGrading (200 300 1)      // block 3
    hex (20 12 16 21 23 14 18 22) (100 50 1) simpleGrading (0.035 300 1)      // block 4
);

edges
(	
    arc 3 2 (5 0.5 0)
    arc 7 6 (5 0.5 0.1)
);

boundary
(
	back
	{
		type empty;
		faces
		(
            (0 1 2 3)
            (1 8 9 2)
            (2 9 13 12)
            (12 13 17 16)
            (20 12 16 21)
		);
	}

	front
	{
		type empty;
		faces
		(
            (4 5 6 7)
            (5 10 11 6)
            (6 11 15 14)
            (14 15 19 18)
            (22 14 18 23)
		);
	}

	nozzle
	{
		type wall;
		faces
		(
            (3 2 6 7)
            (2 12 14 6)
            (20 12 14 23)
		);
	}

    middle
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (1 8 10 5)
        );
    }

	inlet
	{
		type patch;
		faces
		(
            (0 3 4 7)
		);
	}

	downstreamOutlet
	{
		type patch;
		faces
		(
            (8 9 11 10)
            (9 13 15 11)
            (13 17 19 15)
		);
	}

	farfield
	{
		type patch;
		faces
		(
            (16 17 19 18)
            (21 16 18 22)
            (20 21 23 22)
		);
	}
);


mergePatchPairs
(
);


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
