LavalNozzle/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoCentralFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         4.5;

deltaT          1e-6;

writeControl    adjustable;

writeInterval   1e-2;

purgeWrite      0;

writeFormat     binary;

writePrecision   8;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

runTimeModifiable true;

maxCo           0.5;

functions
{

    Mach
    {
        type            MachNo;
        libs            (fieldFunctionObjects);
        field           U;
        log             true;
        executeControl  writeTime;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   1;
    }
   
    solverInfo
    {
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");
        fields          (U p T);
        writeResidualFields no;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
    }

    // monitor the convergence
    fieldAverage
        {
            type             fieldAverage;
            libs             (fieldFunctionObjects);
            executeControl   timeStep;
            executeInterval  1;
            writeControl     writeTime;
            writeInterval    1;
            timeStart        0;

            fields
            (
                U
                {
                    mean        on;
                    prime2Mean  off;
                    base        time;
                }
            );
        }

    sample_lines
    {
        type             sets;
        libs             (sampling);
        executeControl   writeTime;
        executeInterval  1;
        writeControl     writeTime;
        writeInterval    1;
        timeStart        0;
        setFormat        csv;
        fields          (p U rho T Ma);
        sets
        {
            centerline
            {
                type face;
                axis x;
                start (0 0.5 0.05);
                end (500 0.5 0.05);
            }
        }
    }
}

// ************************************************************************* //
